<template>
  <section class="news">
    <div class="sidebar">
      <panel>
        <div slot="head">新闻列表</div>
        <div slot="body">
          <ul class="news-list">
            <li><a v-link="{ name: 'news', params: { id: 0 }}">1、一次性发泡塑料餐具“重出江湖”</a></li>
            <li><a v-link="{ name: 'news', params: { id: 1 }}">2、掌握这些家庭生活常识，居家更简单</a></li>
            <li><a v-link="{ name: 'news', params: { id: 2 }}">3、饮食之道，要注意以下方面</a></li>
            <li><a v-link="{ name: 'news', params: { id: 3 }}">4、普通人不可不知的养生秘诀</a></li>
          </ul>
        </div>
      </panel>
    </div>

    <div class="content">
      <detail-panel>
        <div slot="head">{{{ newDetail.title }}}</div>
        <div slot="body">{{{ newDetail.detail }}}</div>
      </detail-panel>
    </div>
  </section>
</template>

<script>
  import panel from '../components/panel.vue'
  import detailPanel from '../components/detail-panel.vue'

  export default {
    data () {
      return {
        news: [
          {
            title: '广州鸿裕餐饮公司，告诉您一次性发泡塑料餐具“重出江湖”，市民顾虑饮食安全。',
            detail: '<p>一次性发泡塑料餐具被禁用了14年后，今年5月1日起又被正式放出笼子重回市场。</p> <p>其实，一次性发泡塑料餐具被禁的时候也从没有离开过市民的生活。这次突然对其解禁，让不少市民担忧饮食安全和白色污染可能重现。</p> <p>昨天中午时分，归德路旁一家快餐摊点前围了不少用餐的市民。记者<a href="http://www.cnsq.com.cn/shehui/shgc.htm">观察</a>到，摊主先把热腾腾的蒸米及几样炒菜装入透明塑料袋中，然后再将其放入一次性发泡塑料餐具中递给顾客。</p> <p>在株洲路旁一家蒸包店里，店家把蒸包直接放到一次性发泡塑料餐具里递给顾客。其他地方几乎也如此。一位摊主告诉记者，这些一次性发泡塑料餐具是从道北购买来的，很便宜。</p> <p>在一次性发泡塑料餐具没解禁前，我市不少小摊上就没断其身影。而在我市大型餐饮店里，已很少用了，有的改为塑料袋，有的改用纸质包装。</p> <p>部分市民担心，这种一次性发泡塑料餐具的开禁，会使其大量涌入市场，造成污染环境；也有人担心一次性发泡塑料餐具影响身体<a href="http://www.cnsq.com.cn/shishang/index.htm">健康</a>。家住归德路的王进范说：“我从来不用一次性发泡塑料餐具，也不让家人用。多数一次性发泡塑料餐具上没有注明厂家，看了就觉得不放心。”在一家机关单位上班的李媛媛说，她经常到小餐馆、快餐店用餐，使用一次性发泡塑料餐具是不可避免的。她认为，解禁将给环境保护带来一定压力，如果不解决一次性发泡塑料餐具回收问题，可能重蹈白色污染的覆辙，作为消费者，使用起来心里也别扭。</p>'
          },
          {
            title:  '家庭生活常识',
            detail:'1 、巧用牙膏:若有小面积皮肤损伤或烧伤、烫伤，抹上少许牙膏，可立即止血止痛，也可防止感染，疗效颇佳。<br><br>2 、巧除纱窗油腻可将洗衣粉、烟头一起放在水里，待溶解后，拿来擦玻璃窗、纱窗，效果均不错。<br><br>3、将虾仁放入碗内，加一点精盐、食用碱粉，用手抓搓一会儿后用清水浸泡，再用清水洗净，这样能使炒出的虾仁透明如水晶，爽嫩可口<br><br>4、和饺子面的窍门：在1斤面粉里掺入6个蛋清使面里蛋白质增加，包的饺子下锅后蛋白质会很快凝固收缩，起锅后收水快，不易粘连<br><br>5、将残茶叶浸入水中数天后，浇在植物根部，可促进植物生长；把残茶叶晒干，放到厕所或沟渠里燃熏，可消除恶臭，具有驱除蚊蝇的功能。<br><br>6、夹生饭重煮法:如果米饭夹生，可用筷子在饭内扎些直通锅底的孔，洒入少许黄酒，若只表面夹生，只要将表层翻到中间再焖即可。<br><br>7、烹调蔬菜时如果必须要焯焯好菜的水最好尽量利用，如做水饺时焯好的水可适量放在肉馅里，这样即保存营养，又使馅味美有汤<br><br>8 、炒鸡蛋的窍门:将鸡蛋打入碗中，加入少许温水搅拌均匀，倒入油锅里炒，炒时往锅里滴少许酒，这样炒出的鸡蛋蓬松、鲜嫩、可口。<br><br>9 、如何使用砂锅1:新买来的砂锅第一次使用时，最好用来熬粥，或者用它煮一煮浓淘米水，以堵塞砂锅的微细孔隙，防止渗水。<br><br>10、巧用“十三香”:炖肉时用陈皮，香味浓郁；吃牛羊肉加白芷，可除膻增鲜；自制香肠用肉桂，味道鲜美；熏肉熏鸡用丁香，回味无穷。<br><br>11 、和饺子面的窍门面要和的略硬一点，和好后放在盆里盖严密封饧10-15分钟，等面中麦胶蛋白吸水膨胀，充分形成面筋后再包饺子<br><br>12、香菜是一种伞形花科类植物，富含香精油香气浓郁但香精油极易挥发，且经不起长时间加热，香菜最好在食用前加入，以保留其香气。<br><br>13、当进行高温洗涤或干衣程序时不可碰触机门玻璃以免烫伤，拿烘干的衣物时要小心衣物上的金属部分，如拉链、纽扣等，以免烫伤。<br><br>14 、如果衣领和袖口较脏，可将衣物先放进溶有洗衣粉的温水中浸泡15-20分钟，再进行正常洗涤，就能洗干净。<br><br>15 、如何使用砂锅2:用砂锅熬汤、炖肉时，要先往砂锅里放水，再把砂锅置于火上，先用文火，再用旺火。'
          },
          {
            title:  '饮食常识',
            detail:'<br><br><br>薯类<br>薯类食品大都有很强的产气作用，在一些欧洲机场的“健康指引手册”中，土豆、红薯等淀粉类食品被列为“最不推荐在机场餐厅享用的食品”，因为飞机升高时，气压会下降，如果你吃了太多可产气的薯类食品，会感到下体膨胀，并且频频拜访洗手间！<br><br>补充： 养生的早餐：<br><br>豆浆：适合怕胖者，有高血糖或贫血的人。2 纯牛奶：一般人都适合，但需要配主食，配坚果也不错。3 早餐奶：适合乳糖不耐受的人，需要制造饱腹感的人。4 粥类：适合需要养胃的人，小米粥和山药粥都很温补。5 果蔬汁：适合对清肠排毒有需求的人。注意：早餐不要喝冰的，伤身体。<br><br><br><br><br>葡萄<br>吃葡萄后不能立刻喝水，否则，不到一刻钟就会腹泻。原来，葡萄本身有通便润肠之功效，吃完葡萄立即喝水，胃还来不及消化吸收，水就将胃酸冲淡了，葡萄与水、胃酸急剧氧化、发酵、加速了肠道的蠕动，就产生了腹泻。不过，这种腹泻不是细菌引起的，泻完后会不治而愈。<br><br><br><br><br>茶<br>有些人吃完鸡蛋、肉食等高蛋白质食物后，习惯于立即饮茶，以助“消化”。其实，这种做法是不科学的。因为茶叶中含有大量鞣酸，鞣酸与蛋白质合成具有收敛性的鞣酸蛋白质，使肠蠕动减慢，从而延长粪便在肠道内滞留的时间，不但易造成便秘，而且还增加有毒物质和致癌物质被人体吸收的可能性，危害人体健康。<br><br>丹麦面包<br><br>要制成松软酥香的丹麦面包，需往面粉中加入大量起酥油，这样才能形成面包里特殊的层状结构。而起酥油不光让身体发胖，还会影响女性荷尔蒙分泌。由于人体激素水平在早上最敏感，因此欧洲医学专家建议，吃丹麦面包的最佳时间是中午，那时人的雌性激素水平相对稳定，你不会因摄入太多起酥油而失去浓浓女人味！<br><br><br><br><br>咖啡<br>加拿大安大略大学健康学院的霍顿·史密斯教授指出，刚喝完咖啡，人体中枢神经系统的兴奋性较高，这时去健身房，你会在不知觉中运动过量、造成肌肉损伤！<br><br><br><br><br>咖啡伴侣<br>美国食品监管机构指出，速溶咖啡伴侣中的反式脂肪酸含量比薯片还高，而反式脂肪酸是让女人发胖的根本原因！小编建议你尽量喝新鲜咖啡，如果非喝速溶咖啡不可，一定别因贪图口味，往咖啡里加太多咖啡伴侣！<br><br><br><br><br>打电话戴耳机<br>别以为只有运动过量才会遭遇“网球肘”！如果你长时间打电话，肘部绷得太紧，肘关节神经一样会受到伤害，这时你会感到下臂疼痛、肘关节活动不利，电脑操作速度也会被大大影响！因此小编建议你在打电话时尽量戴上耳机！<br><br><br><br><br>常温牛奶<br>牛奶加热时间越长，其中的钙成分流失得越快，而乳糖成分不会有任何变化。营养专家认为，常温牛奶比热牛奶更健康。如果你非喝热牛奶不可，最好不要用微波炉加热，微波会让乳类蛋白变质，使用煤气灶或用开水烫温奶袋是更好的选择<br><br>吃生蒜<br><br>美国爱荷华州立大学研究指出，人脑活动所需的大半能量由维生素B1转化的葡萄糖提供，而生蒜中的蒜胺成分比维生素B1的作用还要强，经常吃生蒜，能让你头脑更聪明！<br><br>优质脂肪酸<br><br>想一直穿性感美丽的裙装？美国医学专家将牛油果、香蕉中的脂肪酸称为“优质脂肪酸”，它不但不会让你发胖，还能有效提高体表温度，即使在偶尔刮风的夜晚，你一样能穿抢眼的连衣裙！<br><br>洋葱<br><br>《黄帝内经》中有“胃不合则卧不安”的说法，如果晚餐选择不对，你很可能在漫漫长夜辗转反侧！而洋葱气味辛辣，属胀气食物，如果在晚餐中吃太多洋葱，你很容易感到腹部胀气，从而导致睡眠质量降低！<br><br><br><br><br>猕猴桃与牛奶<br>猕猴桃中含有大量维生素C和维生素B，两者与牛奶中的乳脂蛋白相结合，容易产生蛋白质凝块，让你腹泻！因此小编建议你吃完猕猴桃2小时后再喝牛奶，或吃其他奶制品！<br><br><br><br><br>饼干<br>印度医学专家研究证明，四成半的恶梦都由低血糖引发，血液中糖分含量过低，会使脑神经皮层细胞吸收过多负面情绪，让你在睡觉时恶梦连连。如果入睡前吃几块饼干或喝一杯加糖的豆浆，能有效减少恶梦，提高你的睡眠质量！<br><br><br><br><br>胃口不好<br>日本早稻田大学医学院的健康报告指出，食欲好坏与鞋子大小有关！由于脚上汇集着6条经脉，直接影响内脏器官的神经反应。当鞋挤脚时，足部血液循环受阻，摄食中枢供血不足，你会感到胃口不好、食欲下降！<br><br><br><br><br>苹果<br>苹果中含有丰富的维生素和酸类物质，新西兰食品专家指出，如果吃苹果速度太慢，会让你胃部分泌大量胃酸，与果酸共同作用，造成消化不良！因此小编建议你：苹果一定在15分钟内吃完！<br><br>香菇<br><br>韩国《文化日报》的客座医学专家建议，女性每日必吃香菇，尤其是经常在阳光下暴晒的香菇。因为香菇中的麦角甾醇在与阳光接触时可产生大量维生素D，这种优质补钙元素可让你腰杆挺直、充满骨感美！<br><br><br><br><br>红萝卜缨<br>加拿大食品专家研究发现，每100克大豆中含钙191毫克，而每100克红萝卜缨中含有360毫克的钙，几乎是大豆的一倍！因此食品专家建议，买菜时不要轻易丢掉珍贵的红萝卜缨，用它熬汤、炒菜或拌沙拉，都能达到意想不到的补钙效果！<br><br><br><br><br>鱼<br>把收拾好的鱼放入牛奶里泡一下，取出后裹一层面粉，再放入热油锅里炸制，鱼的味道会格外鲜美，而且没有腥味。<br><br>去糊锅底<br><br>如果做饭时不小心糊了锅，锅底有锅巴，不易刷掉，可在锅里倒入少许的白酒和啤酒加少量清水混合，比例为1：1：0.5，盖锅盖放置5分钟后再清洗，就很容易洗干净了。<br><br><br><br><br>去小棉絮<br>有些衣服容易粘上絮状物，看着不舒服，如果是黑衣服上粘上了白色絮状物，看起来就更明显了，要去除这些烦人的絮状物，有一个好办法：找一块海绵，浸水后拧干，在衣服表面轻轻擦拭，絮状物就可以被带走了。'
          },
          {
            title:  '养生之道',
            detail:'<br>1.夏天枕头易受潮滋生霉菌，时常曝晒枕芯有利健康；<br><br>2.睡眠不足会变笨，一天需要睡眠八小时，有午睡习惯可延缓衰老；<br><br>3.防失眠：睡前不要讲太多话，忌饮浓茶，睡前勿大用脑，可用热水加醋洗脚；<br><br>4.早餐多食西红柿、柠檬酸等酸性蔬菜和水果，有益于养肝；<br><br>5.葡萄含有睡眠辅助激素，常食有助睡眠；<br><br><br><br>生活常识<br>生活常识<br>6.夏天多喝番茄汤既可获得养料，又能补充水分，番茄汤应烧好并冷却后再喝，所含番茄红素有一定的抗前列腺癌和保护心肌的功效，最适合于男子；吃酸性物质马上刷牙会损害牙齿健康；<br>7.喝酸奶能解酒后烦躁，酸奶能保护胃黏膜、延缓酒精吸收，并且含钙丰富，对缓解酒后烦躁尤其有效；<br><br>8.过多食用生葱蒜会刺激口腔肠胃， 不利健康，最好加一点醋再食用；<br><br>9.及时补充水分但应少喝果汁、可乐、雪碧、汽水等饮料，含有较多的糖精和电解质，喝多了会对肠胃产生不良刺激，影响消化和食欲。因此夏天应多喝白开水或淡盐（糖）水；<br><br>10.空调室内温差不宜超过5℃，即使天气再热，空调室内温度也不宜到24℃以下；<br><br>11.夏天，人的活动时间变长，出汗多，耗能过大，应适当多吃鸡、鸭、瘦肉、鱼类、蛋类等营养食品，以满足人体的代谢需要；<br><br>12.吃大蒜、洋葱可以预防前列腺炎、前列腺增生。<br><br>13.女生冬天感到肢体寒冷是肾阳虚的表现，可以买一些黄芪泡水喝，如喝一段时间后感到口干，阳气恢复正常停一下然后反复如此饮用，效果不错。<br><br>14.蜂蜜和大葱不可同吃，会引起中毒。<br><br>15.香椿做的食物最好不要多吃，会引起胃肠不舒服。<br><br>16.青萝卜与胡萝卜不能同吃，会引起中毒。<br><br>17.冬吃萝卜，夏吃姜，每天适量吃一些姜，可以提高免疫力，尤其是对感冒有效。'
          }
        ]
      }
    },
    props: [],
    computed: {
      newDetail () {
        return this.news[this.$route.params.id]
      }
    },
    methods: {
      getUrlVars () {
        var vars = [], hash;
        var hashes = window.location.href.slice(window.location.href.indexOf('?') + 1).split('&');
        for(var i = 0; i < hashes.length; i++)
        {
          hash = hashes[i].split('=');
          vars.push(hash[0]);
          vars[hash[0]] = hash[1];
        }
        return vars;
      }
    },
    components: {
      panel,
      detailPanel
    }
  }
</script>